{"class_name": "Model", "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 50}, "inbound_nodes": [[["input", 0, 0]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_1", "transform_bias": -1, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]], [["highway_1", 0, 0]], [["highway_1", 1, 0]], [["highway_1", 2, 0]], [["highway_1", 3, 0]], [["highway_1", 4, 0]], [["highway_1", 5, 0]], [["highway_1", 6, 0]], [["highway_1", 7, 0]], [["highway_1", 8, 0]]], "name": "highway_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["highway_1", 9, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_2"}], "input_layers": [["input", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}