{"class_name": "Model", "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "descr_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "title_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "descr_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_mask"}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 50, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.2, "input_dtype": "float32", "batch_input_shape": [null, null, 50], "input_length": null, "dropout_W": 0.2, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 50, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["title_inp", 0, 0]], [["descr_inp", 0, 0]]], "name": "lstm_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "title_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_mask"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_1"}, "inbound_nodes": [[["lstm_1", 0, 0], ["title_mask", 0, 0]]], "name": "poolingseq_1"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_2"}, "inbound_nodes": [[["lstm_1", 1, 0], ["descr_mask", 0, 0]]], "name": "poolingseq_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "ave", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["poolingseq_1", 0, 0], ["poolingseq_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_1", "transform_bias": -1, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]], [["highway_1", 0, 0]], [["highway_1", 1, 0]], [["highway_1", 2, 0]], [["highway_1", 3, 0]], [["highway_1", 4, 0]], [["highway_1", 5, 0]], [["highway_1", 6, 0]], [["highway_1", 7, 0]], [["highway_1", 8, 0]], [["highway_1", 9, 0]], [["highway_1", 10, 0]], [["highway_1", 11, 0]], [["highway_1", 12, 0]], [["highway_1", 13, 0]], [["highway_1", 14, 0]], [["highway_1", 15, 0]], [["highway_1", 16, 0]], [["highway_1", 17, 0]], [["highway_1", 18, 0]], [["highway_1", 19, 0]], [["highway_1", 20, 0]], [["highway_1", 21, 0]], [["highway_1", 22, 0]], [["highway_1", 23, 0]], [["highway_1", 24, 0]], [["highway_1", 25, 0]], [["highway_1", 26, 0]], [["highway_1", 27, 0]], [["highway_1", 28, 0]], [["highway_1", 29, 0]], [["highway_1", 30, 0]], [["highway_1", 31, 0]], [["highway_1", 32, 0]], [["highway_1", 33, 0]], [["highway_1", 34, 0]], [["highway_1", 35, 0]], [["highway_1", 36, 0]], [["highway_1", 37, 0]], [["highway_1", 38, 0]], [["highway_1", 39, 0]], [["highway_1", 40, 0]], [["highway_1", 41, 0]], [["highway_1", 42, 0]], [["highway_1", 43, 0]], [["highway_1", 44, 0]], [["highway_1", 45, 0]], [["highway_1", 46, 0]], [["highway_1", 47, 0]], [["highway_1", 48, 0]], [["highway_1", 49, 0]], [["highway_1", 50, 0]], [["highway_1", 51, 0]], [["highway_1", 52, 0]], [["highway_1", 53, 0]], [["highway_1", 54, 0]], [["highway_1", 55, 0]], [["highway_1", 56, 0]], [["highway_1", 57, 0]], [["highway_1", 58, 0]], [["highway_1", 59, 0]], [["highway_1", 60, 0]], [["highway_1", 61, 0]], [["highway_1", 62, 0]], [["highway_1", 63, 0]], [["highway_1", 64, 0]], [["highway_1", 65, 0]], [["highway_1", 66, 0]], [["highway_1", 67, 0]], [["highway_1", 68, 0]], [["highway_1", 69, 0]], [["highway_1", 70, 0]], [["highway_1", 71, 0]], [["highway_1", 72, 0]], [["highway_1", 73, 0]], [["highway_1", 74, 0]], [["highway_1", 75, 0]], [["highway_1", 76, 0]], [["highway_1", 77, 0]], [["highway_1", 78, 0]], [["highway_1", 79, 0]], [["highway_1", 80, 0]], [["highway_1", 81, 0]], [["highway_1", 82, 0]], [["highway_1", 83, 0]], [["highway_1", 84, 0]], [["highway_1", 85, 0]], [["highway_1", 86, 0]], [["highway_1", 87, 0]], [["highway_1", 88, 0]], [["highway_1", 89, 0]], [["highway_1", 90, 0]], [["highway_1", 91, 0]], [["highway_1", 92, 0]], [["highway_1", 93, 0]], [["highway_1", 94, 0]], [["highway_1", 95, 0]], [["highway_1", 96, 0]], [["highway_1", 97, 0]], [["highway_1", 98, 0]], [["highway_1", 99, 0]], [["highway_1", 100, 0]], [["highway_1", 101, 0]], [["highway_1", 102, 0]], [["highway_1", 103, 0]], [["highway_1", 104, 0]], [["highway_1", 105, 0]], [["highway_1", 106, 0]], [["highway_1", 107, 0]], [["highway_1", 108, 0]], [["highway_1", 109, 0]], [["highway_1", 110, 0]], [["highway_1", 111, 0]], [["highway_1", 112, 0]], [["highway_1", 113, 0]], [["highway_1", 114, 0]], [["highway_1", 115, 0]], [["highway_1", 116, 0]], [["highway_1", 117, 0]], [["highway_1", 118, 0]], [["highway_1", 119, 0]], [["highway_1", 120, 0]], [["highway_1", 121, 0]], [["highway_1", 122, 0]], [["highway_1", 123, 0]], [["highway_1", 124, 0]], [["highway_1", 125, 0]], [["highway_1", 126, 0]], [["highway_1", 127, 0]], [["highway_1", 128, 0]], [["highway_1", 129, 0]], [["highway_1", 130, 0]], [["highway_1", 131, 0]], [["highway_1", 132, 0]], [["highway_1", 133, 0]], [["highway_1", 134, 0]], [["highway_1", 135, 0]], [["highway_1", 136, 0]], [["highway_1", 137, 0]], [["highway_1", 138, 0]], [["highway_1", 139, 0]], [["highway_1", 140, 0]], [["highway_1", 141, 0]], [["highway_1", 142, 0]], [["highway_1", 143, 0]], [["highway_1", 144, 0]], [["highway_1", 145, 0]], [["highway_1", 146, 0]], [["highway_1", 147, 0]], [["highway_1", 148, 0]], [["highway_1", 149, 0]], [["highway_1", 150, 0]], [["highway_1", 151, 0]], [["highway_1", 152, 0]], [["highway_1", 153, 0]], [["highway_1", 154, 0]], [["highway_1", 155, 0]], [["highway_1", 156, 0]], [["highway_1", 157, 0]], [["highway_1", 158, 0]], [["highway_1", 159, 0]], [["highway_1", 160, 0]], [["highway_1", 161, 0]], [["highway_1", 162, 0]], [["highway_1", 163, 0]], [["highway_1", 164, 0]], [["highway_1", 165, 0]], [["highway_1", 166, 0]], [["highway_1", 167, 0]], [["highway_1", 168, 0]], [["highway_1", 169, 0]], [["highway_1", 170, 0]], [["highway_1", 171, 0]], [["highway_1", 172, 0]], [["highway_1", 173, 0]], [["highway_1", 174, 0]], [["highway_1", 175, 0]], [["highway_1", 176, 0]], [["highway_1", 177, 0]], [["highway_1", 178, 0]], [["highway_1", 179, 0]], [["highway_1", 180, 0]], [["highway_1", 181, 0]], [["highway_1", 182, 0]], [["highway_1", 183, 0]], [["highway_1", 184, 0]], [["highway_1", 185, 0]], [["highway_1", 186, 0]], [["highway_1", 187, 0]], [["highway_1", 188, 0]], [["highway_1", 189, 0]], [["highway_1", 190, 0]], [["highway_1", 191, 0]], [["highway_1", 192, 0]], [["highway_1", 193, 0]], [["highway_1", 194, 0]], [["highway_1", 195, 0]], [["highway_1", 196, 0]], [["highway_1", 197, 0]], [["highway_1", 198, 0]]], "name": "highway_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["highway_1", 199, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_1"}], "input_layers": [["title_inp", 0, 0], ["title_mask", 0, 0], ["descr_inp", 0, 0], ["descr_mask", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}