{"class_name": "Model", "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "descr_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "title_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "descr_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_mask"}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 50, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.2, "input_dtype": "float32", "batch_input_shape": [null, null, 50], "input_length": null, "dropout_W": 0.2, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 50, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["title_inp", 0, 0]], [["descr_inp", 0, 0]]], "name": "lstm_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "title_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_mask"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_1"}, "inbound_nodes": [[["lstm_1", 0, 0], ["title_mask", 0, 0]]], "name": "poolingseq_1"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_2"}, "inbound_nodes": [[["lstm_1", 1, 0], ["descr_mask", 0, 0]]], "name": "poolingseq_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "ave", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["poolingseq_1", 0, 0], ["poolingseq_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_1", "transform_bias": -1, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]], [["highway_1", 0, 0]], [["highway_1", 1, 0]], [["highway_1", 2, 0]], [["highway_1", 3, 0]], [["highway_1", 4, 0]], [["highway_1", 5, 0]], [["highway_1", 6, 0]], [["highway_1", 7, 0]], [["highway_1", 8, 0]], [["highway_1", 9, 0]], [["highway_1", 10, 0]], [["highway_1", 11, 0]], [["highway_1", 12, 0]], [["highway_1", 13, 0]], [["highway_1", 14, 0]], [["highway_1", 15, 0]], [["highway_1", 16, 0]], [["highway_1", 17, 0]], [["highway_1", 18, 0]], [["highway_1", 19, 0]], [["highway_1", 20, 0]], [["highway_1", 21, 0]], [["highway_1", 22, 0]], [["highway_1", 23, 0]], [["highway_1", 24, 0]], [["highway_1", 25, 0]], [["highway_1", 26, 0]], [["highway_1", 27, 0]], [["highway_1", 28, 0]], [["highway_1", 29, 0]], [["highway_1", 30, 0]], [["highway_1", 31, 0]], [["highway_1", 32, 0]], [["highway_1", 33, 0]], [["highway_1", 34, 0]], [["highway_1", 35, 0]], [["highway_1", 36, 0]], [["highway_1", 37, 0]], [["highway_1", 38, 0]], [["highway_1", 39, 0]], [["highway_1", 40, 0]], [["highway_1", 41, 0]], [["highway_1", 42, 0]], [["highway_1", 43, 0]], [["highway_1", 44, 0]], [["highway_1", 45, 0]], [["highway_1", 46, 0]], [["highway_1", 47, 0]], [["highway_1", 48, 0]], [["highway_1", 49, 0]], [["highway_1", 50, 0]], [["highway_1", 51, 0]], [["highway_1", 52, 0]], [["highway_1", 53, 0]], [["highway_1", 54, 0]], [["highway_1", 55, 0]], [["highway_1", 56, 0]], [["highway_1", 57, 0]], [["highway_1", 58, 0]], [["highway_1", 59, 0]], [["highway_1", 60, 0]], [["highway_1", 61, 0]], [["highway_1", 62, 0]], [["highway_1", 63, 0]], [["highway_1", 64, 0]], [["highway_1", 65, 0]], [["highway_1", 66, 0]], [["highway_1", 67, 0]], [["highway_1", 68, 0]], [["highway_1", 69, 0]], [["highway_1", 70, 0]], [["highway_1", 71, 0]], [["highway_1", 72, 0]], [["highway_1", 73, 0]], [["highway_1", 74, 0]], [["highway_1", 75, 0]], [["highway_1", 76, 0]], [["highway_1", 77, 0]], [["highway_1", 78, 0]], [["highway_1", 79, 0]], [["highway_1", 80, 0]], [["highway_1", 81, 0]], [["highway_1", 82, 0]], [["highway_1", 83, 0]], [["highway_1", 84, 0]], [["highway_1", 85, 0]], [["highway_1", 86, 0]], [["highway_1", 87, 0]], [["highway_1", 88, 0]], [["highway_1", 89, 0]], [["highway_1", 90, 0]], [["highway_1", 91, 0]], [["highway_1", 92, 0]], [["highway_1", 93, 0]], [["highway_1", 94, 0]], [["highway_1", 95, 0]], [["highway_1", 96, 0]], [["highway_1", 97, 0]], [["highway_1", 98, 0]], [["highway_1", 99, 0]], [["highway_1", 100, 0]], [["highway_1", 101, 0]], [["highway_1", 102, 0]], [["highway_1", 103, 0]], [["highway_1", 104, 0]], [["highway_1", 105, 0]], [["highway_1", 106, 0]], [["highway_1", 107, 0]], [["highway_1", 108, 0]], [["highway_1", 109, 0]], [["highway_1", 110, 0]], [["highway_1", 111, 0]], [["highway_1", 112, 0]], [["highway_1", 113, 0]], [["highway_1", 114, 0]], [["highway_1", 115, 0]], [["highway_1", 116, 0]], [["highway_1", 117, 0]], [["highway_1", 118, 0]], [["highway_1", 119, 0]], [["highway_1", 120, 0]], [["highway_1", 121, 0]], [["highway_1", 122, 0]], [["highway_1", 123, 0]], [["highway_1", 124, 0]], [["highway_1", 125, 0]], [["highway_1", 126, 0]], [["highway_1", 127, 0]], [["highway_1", 128, 0]], [["highway_1", 129, 0]], [["highway_1", 130, 0]], [["highway_1", 131, 0]], [["highway_1", 132, 0]], [["highway_1", 133, 0]], [["highway_1", 134, 0]], [["highway_1", 135, 0]], [["highway_1", 136, 0]], [["highway_1", 137, 0]], [["highway_1", 138, 0]], [["highway_1", 139, 0]], [["highway_1", 140, 0]], [["highway_1", 141, 0]], [["highway_1", 142, 0]], [["highway_1", 143, 0]], [["highway_1", 144, 0]], [["highway_1", 145, 0]], [["highway_1", 146, 0]], [["highway_1", 147, 0]], [["highway_1", 148, 0]], [["highway_1", 149, 0]], [["highway_1", 150, 0]], [["highway_1", 151, 0]], [["highway_1", 152, 0]], [["highway_1", 153, 0]], [["highway_1", 154, 0]], [["highway_1", 155, 0]], [["highway_1", 156, 0]], [["highway_1", 157, 0]], [["highway_1", 158, 0]], [["highway_1", 159, 0]], [["highway_1", 160, 0]], [["highway_1", 161, 0]], [["highway_1", 162, 0]], [["highway_1", 163, 0]], [["highway_1", 164, 0]], [["highway_1", 165, 0]], [["highway_1", 166, 0]], [["highway_1", 167, 0]], [["highway_1", 168, 0]], [["highway_1", 169, 0]], [["highway_1", 170, 0]], [["highway_1", 171, 0]], [["highway_1", 172, 0]], [["highway_1", 173, 0]], [["highway_1", 174, 0]], [["highway_1", 175, 0]], [["highway_1", 176, 0]], [["highway_1", 177, 0]], [["highway_1", 178, 0]], [["highway_1", 179, 0]], [["highway_1", 180, 0]], [["highway_1", 181, 0]], [["highway_1", 182, 0]], [["highway_1", 183, 0]], [["highway_1", 184, 0]], [["highway_1", 185, 0]], [["highway_1", 186, 0]], [["highway_1", 187, 0]], [["highway_1", 188, 0]], [["highway_1", 189, 0]], [["highway_1", 190, 0]], [["highway_1", 191, 0]], [["highway_1", 192, 0]], [["highway_1", 193, 0]], [["highway_1", 194, 0]], [["highway_1", 195, 0]], [["highway_1", 196, 0]], [["highway_1", 197, 0]], [["highway_1", 198, 0]], [["highway_1", 199, 0]], [["highway_1", 200, 0]], [["highway_1", 201, 0]], [["highway_1", 202, 0]], [["highway_1", 203, 0]], [["highway_1", 204, 0]], [["highway_1", 205, 0]], [["highway_1", 206, 0]], [["highway_1", 207, 0]], [["highway_1", 208, 0]], [["highway_1", 209, 0]], [["highway_1", 210, 0]], [["highway_1", 211, 0]], [["highway_1", 212, 0]], [["highway_1", 213, 0]], [["highway_1", 214, 0]], [["highway_1", 215, 0]], [["highway_1", 216, 0]], [["highway_1", 217, 0]], [["highway_1", 218, 0]], [["highway_1", 219, 0]], [["highway_1", 220, 0]], [["highway_1", 221, 0]], [["highway_1", 222, 0]], [["highway_1", 223, 0]], [["highway_1", 224, 0]], [["highway_1", 225, 0]], [["highway_1", 226, 0]], [["highway_1", 227, 0]], [["highway_1", 228, 0]], [["highway_1", 229, 0]], [["highway_1", 230, 0]], [["highway_1", 231, 0]], [["highway_1", 232, 0]], [["highway_1", 233, 0]], [["highway_1", 234, 0]], [["highway_1", 235, 0]], [["highway_1", 236, 0]], [["highway_1", 237, 0]], [["highway_1", 238, 0]], [["highway_1", 239, 0]], [["highway_1", 240, 0]], [["highway_1", 241, 0]], [["highway_1", 242, 0]], [["highway_1", 243, 0]], [["highway_1", 244, 0]], [["highway_1", 245, 0]], [["highway_1", 246, 0]], [["highway_1", 247, 0]], [["highway_1", 248, 0]], [["highway_1", 249, 0]], [["highway_1", 250, 0]], [["highway_1", 251, 0]], [["highway_1", 252, 0]], [["highway_1", 253, 0]], [["highway_1", 254, 0]], [["highway_1", 255, 0]], [["highway_1", 256, 0]], [["highway_1", 257, 0]], [["highway_1", 258, 0]], [["highway_1", 259, 0]], [["highway_1", 260, 0]], [["highway_1", 261, 0]], [["highway_1", 262, 0]], [["highway_1", 263, 0]], [["highway_1", 264, 0]], [["highway_1", 265, 0]], [["highway_1", 266, 0]], [["highway_1", 267, 0]], [["highway_1", 268, 0]], [["highway_1", 269, 0]], [["highway_1", 270, 0]], [["highway_1", 271, 0]], [["highway_1", 272, 0]], [["highway_1", 273, 0]], [["highway_1", 274, 0]], [["highway_1", 275, 0]], [["highway_1", 276, 0]], [["highway_1", 277, 0]], [["highway_1", 278, 0]], [["highway_1", 279, 0]], [["highway_1", 280, 0]], [["highway_1", 281, 0]], [["highway_1", 282, 0]], [["highway_1", 283, 0]], [["highway_1", 284, 0]], [["highway_1", 285, 0]], [["highway_1", 286, 0]], [["highway_1", 287, 0]], [["highway_1", 288, 0]], [["highway_1", 289, 0]], [["highway_1", 290, 0]], [["highway_1", 291, 0]], [["highway_1", 292, 0]], [["highway_1", 293, 0]], [["highway_1", 294, 0]], [["highway_1", 295, 0]], [["highway_1", 296, 0]], [["highway_1", 297, 0]], [["highway_1", 298, 0]], [["highway_1", 299, 0]], [["highway_1", 300, 0]], [["highway_1", 301, 0]], [["highway_1", 302, 0]], [["highway_1", 303, 0]], [["highway_1", 304, 0]], [["highway_1", 305, 0]], [["highway_1", 306, 0]], [["highway_1", 307, 0]], [["highway_1", 308, 0]], [["highway_1", 309, 0]], [["highway_1", 310, 0]], [["highway_1", 311, 0]], [["highway_1", 312, 0]], [["highway_1", 313, 0]], [["highway_1", 314, 0]], [["highway_1", 315, 0]], [["highway_1", 316, 0]], [["highway_1", 317, 0]], [["highway_1", 318, 0]], [["highway_1", 319, 0]], [["highway_1", 320, 0]], [["highway_1", 321, 0]], [["highway_1", 322, 0]], [["highway_1", 323, 0]], [["highway_1", 324, 0]], [["highway_1", 325, 0]], [["highway_1", 326, 0]], [["highway_1", 327, 0]], [["highway_1", 328, 0]], [["highway_1", 329, 0]], [["highway_1", 330, 0]], [["highway_1", 331, 0]], [["highway_1", 332, 0]], [["highway_1", 333, 0]], [["highway_1", 334, 0]], [["highway_1", 335, 0]], [["highway_1", 336, 0]], [["highway_1", 337, 0]], [["highway_1", 338, 0]], [["highway_1", 339, 0]], [["highway_1", 340, 0]], [["highway_1", 341, 0]], [["highway_1", 342, 0]], [["highway_1", 343, 0]], [["highway_1", 344, 0]], [["highway_1", 345, 0]], [["highway_1", 346, 0]], [["highway_1", 347, 0]], [["highway_1", 348, 0]], [["highway_1", 349, 0]], [["highway_1", 350, 0]], [["highway_1", 351, 0]], [["highway_1", 352, 0]], [["highway_1", 353, 0]], [["highway_1", 354, 0]], [["highway_1", 355, 0]], [["highway_1", 356, 0]], [["highway_1", 357, 0]], [["highway_1", 358, 0]], [["highway_1", 359, 0]], [["highway_1", 360, 0]], [["highway_1", 361, 0]], [["highway_1", 362, 0]], [["highway_1", 363, 0]], [["highway_1", 364, 0]], [["highway_1", 365, 0]], [["highway_1", 366, 0]], [["highway_1", 367, 0]], [["highway_1", 368, 0]], [["highway_1", 369, 0]], [["highway_1", 370, 0]], [["highway_1", 371, 0]], [["highway_1", 372, 0]], [["highway_1", 373, 0]], [["highway_1", 374, 0]], [["highway_1", 375, 0]], [["highway_1", 376, 0]], [["highway_1", 377, 0]], [["highway_1", 378, 0]], [["highway_1", 379, 0]], [["highway_1", 380, 0]], [["highway_1", 381, 0]], [["highway_1", 382, 0]], [["highway_1", 383, 0]], [["highway_1", 384, 0]], [["highway_1", 385, 0]], [["highway_1", 386, 0]], [["highway_1", 387, 0]], [["highway_1", 388, 0]], [["highway_1", 389, 0]], [["highway_1", 390, 0]], [["highway_1", 391, 0]], [["highway_1", 392, 0]], [["highway_1", 393, 0]], [["highway_1", 394, 0]], [["highway_1", 395, 0]], [["highway_1", 396, 0]], [["highway_1", 397, 0]], [["highway_1", 398, 0]], [["highway_1", 399, 0]], [["highway_1", 400, 0]], [["highway_1", 401, 0]], [["highway_1", 402, 0]], [["highway_1", 403, 0]], [["highway_1", 404, 0]], [["highway_1", 405, 0]], [["highway_1", 406, 0]], [["highway_1", 407, 0]], [["highway_1", 408, 0]], [["highway_1", 409, 0]], [["highway_1", 410, 0]], [["highway_1", 411, 0]], [["highway_1", 412, 0]], [["highway_1", 413, 0]], [["highway_1", 414, 0]], [["highway_1", 415, 0]], [["highway_1", 416, 0]], [["highway_1", 417, 0]], [["highway_1", 418, 0]], [["highway_1", 419, 0]], [["highway_1", 420, 0]], [["highway_1", 421, 0]], [["highway_1", 422, 0]], [["highway_1", 423, 0]], [["highway_1", 424, 0]], [["highway_1", 425, 0]], [["highway_1", 426, 0]], [["highway_1", 427, 0]], [["highway_1", 428, 0]], [["highway_1", 429, 0]], [["highway_1", 430, 0]], [["highway_1", 431, 0]], [["highway_1", 432, 0]], [["highway_1", 433, 0]], [["highway_1", 434, 0]], [["highway_1", 435, 0]], [["highway_1", 436, 0]], [["highway_1", 437, 0]], [["highway_1", 438, 0]], [["highway_1", 439, 0]], [["highway_1", 440, 0]], [["highway_1", 441, 0]], [["highway_1", 442, 0]], [["highway_1", 443, 0]], [["highway_1", 444, 0]], [["highway_1", 445, 0]], [["highway_1", 446, 0]], [["highway_1", 447, 0]], [["highway_1", 448, 0]], [["highway_1", 449, 0]], [["highway_1", 450, 0]], [["highway_1", 451, 0]], [["highway_1", 452, 0]], [["highway_1", 453, 0]], [["highway_1", 454, 0]], [["highway_1", 455, 0]], [["highway_1", 456, 0]], [["highway_1", 457, 0]], [["highway_1", 458, 0]], [["highway_1", 459, 0]], [["highway_1", 460, 0]], [["highway_1", 461, 0]], [["highway_1", 462, 0]], [["highway_1", 463, 0]], [["highway_1", 464, 0]], [["highway_1", 465, 0]], [["highway_1", 466, 0]], [["highway_1", 467, 0]], [["highway_1", 468, 0]], [["highway_1", 469, 0]], [["highway_1", 470, 0]], [["highway_1", 471, 0]], [["highway_1", 472, 0]], [["highway_1", 473, 0]], [["highway_1", 474, 0]], [["highway_1", 475, 0]], [["highway_1", 476, 0]], [["highway_1", 477, 0]], [["highway_1", 478, 0]], [["highway_1", 479, 0]], [["highway_1", 480, 0]], [["highway_1", 481, 0]], [["highway_1", 482, 0]], [["highway_1", 483, 0]], [["highway_1", 484, 0]], [["highway_1", 485, 0]], [["highway_1", 486, 0]], [["highway_1", 487, 0]], [["highway_1", 488, 0]], [["highway_1", 489, 0]], [["highway_1", 490, 0]], [["highway_1", 491, 0]], [["highway_1", 492, 0]], [["highway_1", 493, 0]], [["highway_1", 494, 0]], [["highway_1", 495, 0]], [["highway_1", 496, 0]], [["highway_1", 497, 0]], [["highway_1", 498, 0]]], "name": "highway_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["highway_1", 499, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_1"}], "input_layers": [["title_inp", 0, 0], ["title_mask", 0, 0], ["descr_inp", 0, 0], ["descr_mask", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}