{"class_name": "Model", "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "descr_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50], "name": "title_inp", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_inp"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "descr_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "descr_mask"}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 50, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.2, "input_dtype": "float32", "batch_input_shape": [null, null, 50], "input_length": null, "dropout_W": 0.2, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 50, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["title_inp", 0, 0]], [["descr_inp", 0, 0]]], "name": "lstm_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "title_mask", "input_dtype": "float32"}, "inbound_nodes": [], "name": "title_mask"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_1"}, "inbound_nodes": [[["lstm_1", 0, 0], ["title_mask", 0, 0]]], "name": "poolingseq_1"}, {"class_name": "PoolingSeq", "config": {"trainable": true, "name": "poolingseq_2"}, "inbound_nodes": [[["lstm_1", 1, 0], ["descr_mask", 0, 0]]], "name": "poolingseq_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "ave", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["poolingseq_1", 0, 0], ["poolingseq_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_1", "transform_bias": -1, "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0]], [["highway_1", 0, 0]]], "name": "highway_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["highway_1", 1, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_1"}], "input_layers": [["title_inp", 0, 0], ["title_mask", 0, 0], ["descr_inp", 0, 0], ["descr_mask", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}}