{"loss": "NCE_seq_loss", "optimizer": {"epsilon": 1e-08, "lr": 0.009999999776482582, "name": "RMSprop", "rho": 0.8999999761581421}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "main_inp", "input_dtype": "int64"}, "inbound_nodes": [], "name": "main_inp"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 1601, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.0, "output_dim": 100, "input_length": 100}, "inbound_nodes": [[["main_inp", 0, 0]]], "name": "embedding_1"}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 100, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.0, "input_dtype": "float32", "batch_input_shape": [null, null, 100], "input_length": null, "dropout_W": 0.0, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 100, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "lstm_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "next_inp", "input_dtype": "int64"}, "inbound_nodes": [], "name": "next_inp"}, {"class_name": "NCE_seq", "config": {"vocab_size": 1601, "W_constraint": null, "b_constraint": null, "name": "nce_seq_1", "activity_regularizer": null, "trainable": true, "n_noise": 100, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 100, "batch_input_shape": [null, 100], "W_regularizer": null, "activation": "linear", "b_regularizer": null}, "inbound_nodes": [[["lstm_1", 0, 0], ["next_inp", 0, 0]]], "name": "nce_seq_1"}], "input_layers": [["main_inp", 0, 0], ["next_inp", 0, 0]], "output_layers": [["nce_seq_1", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}